       identification division.
       program-id. HelloWorldProgram.
       author. Joey Cluett.

       procedure division.
       
       display "Hello World!".
       

       stop run.


